In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.DataFrame()

In [4]:
print df

Empty DataFrame
Columns: []
Index: []

In [5]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16],[17,18,19,20]])

In [6]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [7]:
df1.head()

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [8]:
df1.to_csv('export.csv')

In [9]:
df1.head(2)

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [10]:
df1.tail(2)

    0   1   2   3
3  13  14  15  16
4  17  18  19  20

In [11]:
df1.shape

(5, 4)

In [12]:
df1.iloc[0,1]

2

In [13]:
df1.iloc[0:2,0:3]

   0  1  2
0  1  2  3
1  5  6  7

In [14]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [15]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16],[17,18,19,20]],columns=['A','B','C','D'])

In [16]:
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [17]:
dff = pd.read_csv('data.csv')

In [18]:
dff.head()

,SYMBOL,SERIES,DATE1,PREV_CLOSE,OPEN_PRICE,HIGH_PRICE,LOW_PRICE,LAST_PRICE,CLOSE_PRICE,AVG_PRICE,TTL_TRD_QNTY,TURNOVER_LACS,NO_OF_TRADES,DELIV_QTY,DELIV_PER
0,20MICRONS,EQ,01-Oct-2018,42.45,43.20,43.60,40.05,42.00,41.85,41.77,60938,25.45,719,38972,63.95
1,21STCENMGM,EQ,01-Oct-2018,28.85,28.85,28.85,28.30,28.30,28.30,28.34,1393,0.39,13,1393,100.00
2,3IINFOTECH,EQ,01-Oct-2018,3.40,3.40,3.40,3.25,3.40,3.35,3.34,2969010,99.28,913,1059680,35.69
3,3MINDIA,EQ,01-Oct-2018,22568.05,22500.00,23300.00,21555.60,23200.00,23088.15,22748.96,3079,700.44,1690,1612,52.35
4,5PAISA,EQ,01-Oct-2018,226.20,239.50,239.50,203.60,211.50,210.80,217.54,28915,62.90,520,15739,54.43

In [19]:
dff['SYMBOL'].dtype

dtype('O')

In [20]:
dff[' PREV_CLOSE'].dtype

dtype('float64')

In [21]:
print(dff[' SERIES'].astype('category'))

0        EQ
1        EQ
2        EQ
3        EQ
4        EQ
5        EQ
6        BE
7        EQ
8        EQ
9        EQ
10       EQ
11       SM
12       EQ
13       EQ
14       EQ
15       EQ
16       EQ
17       BZ
18       BE
19       EQ
20       EQ
21       SM
22       EQ
23       EQ
24       EQ
25       EQ
26       EQ
27       EQ
28       EQ
29       BE
       ...
1915     EQ
1916     EQ
1917     BE
1918     EQ
1919     EQ
1920     EQ
1921     SM
1922     BE
1923     EQ
1924     EQ
1925     BE
1926     EQ
1927     EQ
1928     EQ
1929     P2
1930     EQ
1931     EQ
1932     BE
1933     BE
1934     EQ
1935     EQ
1936     EQ
1937     SM
1938     EQ
1939     EQ
1940     SM
1941     EQ
1942     EQ
1943     EQ
1944     BE
Name:  SERIES, Length: 1945, dtype: category
Categories (57, object): [BE, BZ, D1, DR, ..., YJ, YK, YL, YM]

In [23]:
df1.to_csv('exportIndexFalse.csv',index=False)

In [25]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16],[17,18,19,20]],columns=['A','B','C','D'])

In [26]:
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [27]:
df2 = pd.DataFrame([[11,12,13,14],[15,16,17,18],[19,20,21,22],[23,24,25,26],[27,28,29,30]],columns=['W','X','Y','Z'])

In [28]:
df2

    W   X   Y   Z
0  11  12  13  14
1  15  16  17  18
2  19  20  21  22
3  23  24  25  26
4  27  28  29  30

In [34]:
df3 = pd.merge(df1,df2,right_on="X",left_on="D")

In [35]:
df3

    A   B   C   D   W   X   Y   Z
0   9  10  11  12  11  12  13  14
1  13  14  15  16  15  16  17  18
2  17  18  19  20  19  20  21  22